### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [66]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [67]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [68]:
total = pd.DataFrame(data = {'Total Players':[purchase_data['SN'].nunique()]})
total

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [69]:
#Number uof unique items
Number_uniqueitems = pd.DataFrame(data = {'Number of Unique Items':[purchase_data['Item Name'].nunique()],
                                         'Average Price':[purchase_data["Price"].mean()],
                                         'Number of Purchases':[purchase_data['Purchase ID'].nunique()], 
                                         'Total Revenue':[purchase_data['Price'].sum()],
                                         })
Number_uniqueitems

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [27]:

Average_price = pd.DataFrame(data={'Average Price':[purchase_data["Price"].mean()]})
Average_price

   Average Price
0       3.050987

In [26]:
Number_purchases = pd.DataFrame(data={'Number of Purchases':[purchase_data['Purchase ID'].nunique()]})
Number_purchases

   Number of Purchases
0                  780

In [29]:
Total_revenue = pd.DataFrame(data={'Total Revenue':[purchase_data['Price'].sum()]})
Total_revenue

   Total Revenue
0        2379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [70]:
purchase_data2 = purchase_data.drop_duplicates(subset=['SN'])
purchase_data2 = purchase_data2['Gender'].value_counts().reset_index().set_index('index')
purchase_data2['Percentage of Players'] = purchase_data2['Gender']/purchase_data2['Gender'].sum()
purchase_data2.style.format({'Percentage of Players':'{:.2%}'})

In [37]:
#Non_duplicates = purchase_data.drop_duplicates(subset=['SN'])

In [38]:


#count = Non_duplicates["Gender"].value_counts()
#count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [71]:
purchase_data3 = purchase_data.groupby('Gender').agg({'Purchase ID': 'count', 'Price':['mean','sum']}).reset_index()
purchase_data3

                  Gender Purchase ID     Price
                               count      mean      sum
0                 Female         113  3.203009   361.94
1                   Male         652  3.017853  1967.64
2  Other / Non-Disclosed          15  3.346000    50.19

In [72]:
user_purchase = purchase_data.groupby(['SN','Gender'])['Price'].sum().reset_index()
user_purchase = user_purchase.groupby('Gender')['Price'].mean().reset_index()
user_purchase

                  Gender     Price
0                 Female  4.468395
1                   Male  4.065372
2  Other / Non-Disclosed  4.562727

In [73]:
purchase4 = purchase_data3.merge(user_purchase, how='left', on='Gender')
purchase4 = purchase4.drop(columns = ['Gender'])
purchase4

/opt/anaconda3/envs/myenv/lib/python3.6/site-packages/pandas/core/reshape/merge.py:643: UserWarning: merging between different levels can give an unintended result (2 levels on the left,1 on the right)
  warnings.warn(msg, UserWarning)

,"(Gender, )","(Purchase ID, count)","(Price, mean)","(Price, sum)",Price
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [47]:
#purchase4 = purchase4.drop(columns = ['Gender'])
#purchase4

0                   Female
1                     Male
2    Other / Non-Disclosed
Name: Gender, dtype: object

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

# Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [74]:
#Generate copy of original data frame to not affect the original
purchase_bins = purchase_data
purchase_bins

#Define function to create bins based on the columns "Age" of the dataframe
def parse_bins(x): #parse_bins is the name I assigned to the function
    if x < 10:
        return '<10'
    elif x>=10 and x<=14:
        return '10-14'
    elif x >= 15 and x <= 19:        
        return '15-19'
    elif x >= 20 and x <= 24:
        return '20-24'
    elif x >= 25 and x <= 29:
        return '25-29'
    elif x >= 30 and x <= 34:
        return '30-34'
    elif x >= 35 and x <= 39:
        return '35-39'
    elif x >= 40:
        return '40+'
    
#apply function to reate the new column
purchase_bins['Bins'] =  purchase_bins['Age'].apply(parse_bins)
purchase_bins

#Delete duplicates to create the correct count
purchase_bins_nodup = purchase_bins.drop_duplicates(subset='SN')
purchase_bins_nodup = purchase_bins_nodup.groupby('Bins')['SN'].count().reset_index()

#Summarize data and format 
purchase_bins_nodup['Percentage of Players'] = purchase_bins_nodup['SN']/purchase_bins_nodup['SN'].sum()
purchase_bins_nodup = purchase_bins_nodup.rename(columns={'SN':'Total Count'})
purchase_bins_nodup.set_index('Bins').style.format({'Percentage of Players':'{:.2%}'})

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [78]:
bins_summary = purchase_bins
purchase_count = bins_summary.groupby('Bins')['Purchase ID'].count().reset_index().rename(columns={'Purchase ID':'Purchase Count'})
Average_purchase_price = bins_summary.groupby('Bins')['Price'].mean().reset_index().rename(columns={'Price':'Average Purchase Price'})
Total_purchase_value = bins_summary.groupby('Bins')['Price'].sum().reset_index().rename(columns={'Price':'Total Purchase Value'})
average_purchase_total = bins_summary.groupby(['SN','Bins'])['Price'].sum().reset_index()
average_purchase_total = average_purchase_total.groupby('Bins')['Price'].mean().reset_index().rename(columns={'Price':'Avg Total Purchase per Person'})


final = purchase_count.merge(Average_purchase_price,how='inner',on='Bins').merge(Total_purchase_value,how='inner',on='Bins').merge(average_purchase_total,how='inner',on='Bins')
final

,Bins,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,10-14,28,2.956429,82.78,3.762727
1,15-19,136,3.035956,412.89,3.858785
2,20-24,365,3.052219,1114.06,4.318062
3,25-29,101,2.900990,293.00,3.805195
4,30-34,73,2.931507,214.00,4.115385
5,35-39,41,3.601707,147.67,4.763548
6,40+,13,2.941538,38.24,3.186667
7,<10,23,3.353478,77.13,4.537059

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80